IDEA Open Model
LoadOnSurface.Direction Property
Compatible with IDEA StatiCa v 10.1
 Load direction LCS or GCS
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public LoadDirection Direction { get; set; }
Public Property Direction As LoadDirection
	Get
	Set
public:
property LoadDirection Direction {
	LoadDirection get ();
	void set (LoadDirection value);
}
Property Value
Type: LoadDirection
See Also
Reference
LoadOnSurface Class
IdeaRS.OpenModel.Loading Namespace